ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF51/source/nRF5xPalSecurityManager.cpp
    KeyDistribution* own_dist = NULL;
    KeyDistribution* peer_dist = NULL;

    if (pairing_cb.role == PAIRING_INITIATOR) {
        own_dist = &initiator_dist;
        peer_dist = &responder_dist;
    } else {
        own_dist = &responder_dist;
        peer_dist = &initiator_dist;
    }

    ble_gap_sec_keyset_t keyset = {
        /* keys_own */ {
            own_dist->get_encryption() ? &pairing_cb.own_enc_key : NULL,
            own_dist->get_identity() ? &pairing_cb.own_id_key : NULL,
            own_dist->get_signing() ? &pairing_cb.own_sign_key : NULL,
            &pairing_cb.own_pk
        },
        /* keys_peer */ {
            peer_dist->get_encryption() ? &pairing_cb.peer_enc_key : NULL,
            peer_dist->get_identity() ? &pairing_cb.peer_id_key : NULL,
            peer_dist->get_signing() ? &pairing_cb.peer_sign_key : NULL,
            &pairing_cb.peer_pk
        }
    };

    // copy csrk if necessary
    if (keyset.keys_own.p_sign_key) {
        memcpy(keyset.keys_own.p_sign_key->csrk, _csrk.data(), _csrk.size());
    }

    // copy public keys used
#if defined(MBEDTLS_ECDH_C)
    memcpy(pairing_cb.own_pk.pk, X.data(), X.size());
    memcpy(pairing_cb.own_pk.pk + X.size(), Y.data(), Y.size());
#endif
    return keyset;
}

nRF5xSecurityManager::pairing_control_block_t*
nRF5xSecurityManager::allocate_pairing_cb(connection_handle_t connection)
{
    pairing_control_block_t* pairing_cb =
        new (std::nothrow) pairing_control_block_t();
    if (pairing_cb)  {
        pairing_cb->next = _control_blocks;
        _control_blocks = pairing_cb;
    }
    return pairing_cb;
}

void nRF5xSecurityManager::release_pairing_cb(pairing_control_block_t* pairing_cb)
{
    if (pairing_cb == _control_blocks) {
        _control_blocks = _control_blocks->next;
        delete pairing_cb;
    } else {
        pairing_control_block_t* it = _control_blocks;
        while (it->next) {
            if (it->next == pairing_cb) {
                it->next = pairing_cb->next;
                delete pairing_cb;
                return;
            }
            it = it->next;
        }
    }
}

nRF5xSecurityManager::pairing_control_block_t*
nRF5xSecurityManager::get_pairing_cb(connection_handle_t connection)
{
    pairing_control_block_t* pcb = _control_blocks;
    while (pcb) {
        if (pcb->connection == connection) {
            return pcb;
        }
        pcb = pcb->next;
    }

    return NULL;
}

void nRF5xSecurityManager::release_all_pairing_cb()
{
    while(_control_blocks) {
        release_pairing_cb(_control_blocks);
    }
}

} // nordic
} // vendor
} // pal
} // ble

